config/gptel/sessions/constants.org
#+title: GPTEL Session Constants
#+property: header-args:emacs-lisp :tangle constants.el
#+auto_tangle: y

* Session Constants

This module defines all constant values used throughout the gptel sessions system. Centralizing these values eliminates magic strings and makes the codebase easier to maintain.

** Requirements

#+begin_src emacs-lisp
(require 'cl-lib)
#+end_src

** Tree Structure Constants

#+begin_src emacs-lisp
(defconst jf/gptel-session-tree-root-id "root"
  "The ID of the root node in the session conversation tree.
All conversation paths start from this node.")
#+end_src

** Node ID Prefixes

#+begin_src emacs-lisp
(defconst jf/gptel-session-node-prefix-message "message-"
  "Prefix for user message node IDs.
Format: message-N or message-N-altM for branches.")

(defconst jf/gptel-session-node-prefix-response "response-"
  "Prefix for assistant response node IDs.
Format: response-N or response-N-altM for branches.")

(defconst jf/gptel-session-node-prefix-trace "trace-"
  "Prefix for agent execution trace node IDs.
Format: trace-N")
#+end_src

** File and Directory Names

#+begin_src emacs-lisp
(defconst jf/gptel-session-metadata-filename "metadata.json"
  "Name of the session metadata file stored in each session directory.")

(defconst jf/gptel-session-traces-dirname "traces"
  "Name of the subdirectory containing agent execution traces.")

(defconst jf/gptel-session-trace-metadata-filename "metadata.json"
  "Name of the trace metadata file within each trace directory.")

(defconst jf/gptel-session-trace-tool-results-dirname "tool-results"
  "Name of the subdirectory containing large tool result outputs.")
#+end_src

** Node ID Patterns

#+begin_src emacs-lisp
(defconst jf/gptel-session-node-patterns
  '((:message . "^message-\\([0-9]+\\)\\(?:-alt\\([0-9]+\\)\\)?$")
    (:response . "^response-\\([0-9]+\\)\\(?:-alt\\([0-9]+\\)\\)?$")
    (:trace . "^trace-\\([0-9]+\\)$"))
  "Regular expression patterns for parsing node IDs.
Each pattern captures the sequence number and optional alternate number.")
#+end_src

** Node ID Parser

#+begin_src emacs-lisp
(defun jf/gptel--node-id-parse (node-id)
  "Parse NODE-ID and return its components.
Returns a plist (:type TYPE :number N :alt M) or nil if invalid.
TYPE is one of :message, :response, or :trace.
N is the sequence number (integer).
M is the alternate/branch number (integer or nil for main path)."
  (let ((result nil))
    (cl-loop for (type . pattern) in jf/gptel-session-node-patterns
             when (string-match pattern node-id)
             do (setq result
                      (list :type type
                            :number (string-to-number (match-string 1 node-id))
                            :alt (when (match-string 2 node-id)
                                   (string-to-number (match-string 2 node-id)))))
             and return t)
    result))
#+end_src

** Overlay Properties

#+begin_src emacs-lisp
(defconst jf/gptel-session-overlay-properties
  '((jf/session-id . "Session ID for cross-buffer context tracking"))
  "Documented overlay properties used by the session system.
This defines the contract for overlay properties that components
may inspect or modify.")
#+end_src

* Provide Feature

#+begin_src emacs-lisp
(provide 'jf/gptel-session-constants)
#+end_src
